Documents/_ВозвратОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>_ВозвратОтПокупателя</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТовара</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.Деньги</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКонсигнации</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ПоступлениеСписаниеДС</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВернутьДеньги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сборщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходняНакладная</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаВозврата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныВозврата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Comment>в валюте док-та продажи</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВБазВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаценкаВБазВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПрихода</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Долги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Долги</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДолгПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолгПоставщику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаПоставщику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Чем</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасходыДоходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>РасходыДоходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоходРасход</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Деньги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Деньги</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РезервыТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвойсПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ДоходРасход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДоходРасход</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/_ВозвратОтПокупателя/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// © Primus1C  02.04.2025  НАЧАЛО ►
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄

	Если глЗапретЗаписиПоДате(Ссылка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;      
	
	// © Primus1C  02.04.2025  НАЧАЛО ►
    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
	СуммаДокумента = Товары.Итог("СуммаПродажи");
	// © Primus1C  ОКОНЧАНИЕ ◄ 
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = глПрефиксДефис(Фирма);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Фирма = гоФирма();
	КемСоздан = гоПользователь(); 
	Создан = ТекущаяДата(); 
	
	Валюта = Фирма.Валюта;
	Склад = Фирма.Склад;
	
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() <> 0 Тогда
		Склад = Мас[0];
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// © Primus1C  02.04.2025  НАЧАЛО ► 

	Для каждого СтрокаТЧ Из Товары Цикл
		Если СтрокаТЧ.Партия.ДатаПартии > Дата Тогда
			Сообщить(СтрШаблон(НСтр("ru = 'Строка %1: дата возврата меньше даты партии!'; en = 'Row %1: The document date is less than the lot date!'"), СтрокаТЧ.НомерСтроки));
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Запр = Новый Запрос;        
	Запр.УстановитьПараметр("Фирма", 	Фирма);
	//Запр.УстановитьПараметр("Склад",	Склад);
	Запр.УстановитьПараметр("Дата",		Дата);
	Запр.УстановитьПараметр("Ссылка",	Ссылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	ОстаткиТовараОстатки.ОстатокОстаток КАК Остаток,
	             |	ВозвратТовары.Партия КАК Партия,
	             |	ВозвратТовары.Количество КАК Количество,
	             |	ВозвратТовары.НомерСтроки КАК НомерСтроки
	             |ИЗ
	             |	Документ._ВозвратОтПокупателя.Товары КАК ВозвратТовары
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(
	             |				&Дата,
	             |				Фирма = &Фирма           
	             //|					И Склад = &Склад
	             |					И Партия В
	             |						(ВЫБРАТЬ
	             |							ВозвратОтПокупателяТовары.Партия КАК Партия
	             |						ИЗ
	             |							Документ._ВозвратОтПокупателя.Товары КАК ВозвратОтПокупателяТовары
	             |						ГДЕ
	             |							ВозвратОтПокупателяТовары.Ссылка = &Ссылка)) КАК ОстаткиТовараОстатки
	             |		ПО ВозвратТовары.Партия = ОстаткиТовараОстатки.Партия
	             |ГДЕ
	             |	ВозвратТовары.Ссылка = &Ссылка
	             |	И ОстаткиТовараОстатки.ОстатокОстаток > 0"; 
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить(СтрШаблон(НСтр("ru = 'Строка %1: на складе уже есть эта партия!'; en = 'Row %1: This lot is already in a store!'"), Выборка.НомерСтроки));
    	Отказ = Истина;
	КонецЦикла;      
	
	Если Отказ Тогда
	    Возврат;
	КонецЕсли;

	// © Primus1C  ОКОНЧАНИЕ ◄
	
	Движения.Продажи.Записывать			 = Истина;
	Движения.ОстаткиТовара.Записывать	 = Истина;
	Движения.Долги.Записывать			 = Истина;
	Движения.РасходыДоходы.Записывать	 = Истина;
	Движения.Деньги.Записывать			 = Истина;
	
	ВалютаДоллар = гоПараметрСеанса("БазоваяВалюта");  

	Для каждого ТекСтрока Из Товары Цикл
		Если ТекСтрока.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		//Возврат на склад
		Движение				 = Движения.ОстаткиТовара.ДобавитьПриход();
		Движение.Период			 = Дата;
		Движение.Фирма			 = Фирма;
		Движение.Склад			 = Склад;
		Движение.Номенклатура	 = ТекСтрока.Номенклатура;
		Движение.Партия			 = ТекСтрока.Партия;
		Движение.Остаток		 = ТекСтрока.Количество;
		
		//Возврат денег
		Если ВернутьДеньги Тогда
			Движение				 = Движения.Деньги.ДобавитьРасход();
			Движение.Период			 = Дата;
			Движение.Фирма			 = Фирма;
			Движение.Касса			 = Касса;
			Движение.Валюта			 = ТекСтрока.Валюта;
			Движение.Остаток		 = ТекСтрока.СуммаПродажи;
		Иначе
			Выборка = ПолучитьВыборкуПоВзаиморасчетам(ТекСтрока);
			
			Движение				 = Движения.Долги.ДобавитьРасход();
			Движение.Период			 = Дата;
			Движение.Фирма			 = Выборка.Фирма;
			Движение.Док			 = Выборка.Док;
			Движение.Валюта			 = Выборка.Валюта;
			Движение.Контрагент		 = Выборка.Контрагент;
			
			Движение.ДолгПокупателя	 = ТекСтрока.СуммаПродажи;
			Движение.Покупатель		 = ТекСтрока.СуммаПродажи;
		КонецЕсли;
		
		//Продажи
		ВыборкаПродаж = ПолучитьВыборкуПоПродажам(ТекСтрока);
		
		Движение				 	= Движения.Продажи.Добавить();
		Движение.Период			 	= Дата;
		Движение.Фирма			 	= Фирма;
		Движение.Покупатель		 	= ВыборкаПродаж.Покупатель;
		Движение.Валюта			 	= ВыборкаПродаж.Валюта;
		Движение.Номенклатура	 	= ВыборкаПродаж.Номенклатура;
		Движение.Партия	 		 	= ВыборкаПродаж.Партия;
		Движение.Поставщик		 	= ВыборкаПродаж.Поставщик;
		Движение.ДокументПрихода 	= ВыборкаПродаж.ДокументПрихода;
		Движение.Автор			 	= ВыборкаПродаж.Автор;
		Движение.Склад				= ВыборкаПродаж.Склад;
		
		Движение.Сумма			 	= -ТекСтрока.СуммаПродажи;
		Движение.Количество		 	= -ТекСтрока.Количество;
		//Движение.Наценка		 	= -ТекСтрока.Количество/Выборка.Количество*Выборка.Сумма;
		Движение.Наценка		 	= -ВыборкаПродаж.Наценка;
		Движение.СуммаВБазВалюте 	= -ВыборкаПродаж.СуммаВБазВалюте;
		Движение.НаценкаВБазВалюте 	= -ВыборкаПродаж.НаценкаВБазВалюте;
		
		// © Primus1C  06.12.2025  НАЧАЛО ► закомментировано, перенесено ниже
		
		////Расходы/доходы   -ВКД - раскомментировано движение по регистру 
		////По просьбе Ирины от 30.01.2018:  было закомментировано
		//Движение				 = Движения.РасходыДоходы.Добавить();
		//Движение.Период			 = Дата;
		//Движение.Фирма			 = Фирма;
		//Движение.Вид			 = Перечисления.ДоходРасход.Доход;
		//Движение.Статья			 = Справочники.Статьи.ДоходОтПродажи;
		//Движение.Валюта			 = ТекСтрока.Валюта;
		////ВКД++
		//Наценка = ВКД_ПолучитьНаценкуПоНаменклатуре(ТекСтрока.РасходняНакладная, ТекСтрока.Серия);
		//Движение.Сумма = - Наценка;
		////Движение.Сумма                         = -ТекСтрока.СуммаПродажи;
		////ВКД--

		// © Primus1C  ОКОНЧАНИЕ ◄

	КонецЦикла;
	
	
	// © Primus1C  22.07.2026  НАЧАЛО ►
	
	// РН РезервыТовара  
	
	Движения.РезервыТовара.Записывать = Истина;
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", Ссылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	_ВозвратОтПокупателяТовары.Номенклатура КАК Номенклатура,
	             |	-СУММА(_ВозвратОтПокупателяТовары.Количество) КАК Количество,
	             |	_ВозвратОтПокупателяТовары.РасходняНакладная.ДокументОснование КАК Заказ
	             |ИЗ
	             |	Документ._ВозвратОтПокупателя.Товары КАК _ВозвратОтПокупателяТовары
	             |ГДЕ
	             |	_ВозвратОтПокупателяТовары.Ссылка = &Ссылка
	             |	И _ВозвратОтПокупателяТовары.РасходняНакладная.ДокументОснование.РезервироватьТовар
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	_ВозвратОтПокупателяТовары.Номенклатура,
	             |	_ВозвратОтПокупателяТовары.РасходняНакладная.ДокументОснование";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.РезервыТовара.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Номенклатура 	= Выборка.Номенклатура;
		Движение.Заказ 			= Выборка.Заказ;   
		Движение.Склад          = Склад;
		Движение.Фирма          = Фирма;
		Движение.Количество 	= Выборка.Количество;
	КонецЦикла;
	
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	
	// © Primus1C  06.12.2025  НАЧАЛО ►
	// РН Расходы/доходы
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	СУММА(РНТовары.СуммаПродажи - ВозвратТовары.Количество * РНТовары.ВКД_ЦенаСЗатратами) КАК СуммаСЗатратами,
	             |	РНТовары.Партия.Док.ВКД_Инвойс.ДокументОснование.СкладОтправитель.Статья КАК Статья,
	             |	РНТовары.Ссылка.Валюта КАК Валюта
	             |ИЗ
	             |	Документ._ВозвратОтПокупателя.Товары КАК ВозвратТовары
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Товары КАК РНТовары
	             |		ПО ВозвратТовары.Партия = РНТовары.Партия
	             |			И ВозвратТовары.РасходняНакладная = РНТовары.Ссылка
	             |ГДЕ
	             |	ВозвратТовары.Ссылка = &Ссылка
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	РНТовары.Партия.Док.ВКД_Инвойс.ДокументОснование.СкладОтправитель.Статья,
	             |	РНТовары.Ссылка.Валюта";
	Запр.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		Если ЗначениеЗаполнено(Выборка.Статья) Тогда
			лСтатья = Выборка.Статья	
		Иначе
		    лСтатья = Справочники.Статьи.ДоходОтПродажи;
		КонецЕсли;
		//Сообщить(СтрШаблон("%1: %2 %3", лСтатья, Выборка.СуммаСЗатратами, Выборка.Валюта.Символ)); 
		Движение = Движения.РасходыДоходы.Добавить();
		Движение.Период 	= Дата;
		Движение.Фирма 		= Фирма;
		Движение.Вид 		= Перечисления.ДоходРасход.Доход;
		Движение.Статья 	= лСтатья;
		Движение.Валюта 	= Выборка.Валюта;
		Движение.Сумма 		= - Выборка.СуммаСЗатратами;
	КонецЦикла;

	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

Функция ПолучитьВыборкуПоПродажам(ТекСтрока)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Продажи.Период КАК Период,
	               |	Продажи.Регистратор КАК Регистратор,
	               |	Продажи.Фирма КАК Фирма,
	               |	Продажи.Покупатель КАК Покупатель,
	               |	Продажи.Поставщик КАК Поставщик,
	               |	Продажи.Автор КАК Автор,
	               |	Продажи.Валюта КАК Валюта,
	               |	Продажи.Номенклатура КАК Номенклатура,
	               |	Продажи.Партия КАК Партия,
	               |	Продажи.ДокументПрихода КАК ДокументПрихода,
	               |	Продажи.Сумма КАК Сумма,
	               |	Продажи.Количество КАК Количество,
	               |	Продажи.Наценка КАК Наценка,
	               |	Продажи.Склад КАК Склад,
	               |	Продажи.СуммаВБазВалюте КАК СуммаВБазВалюте,
	               |	Продажи.НаценкаВБазВалюте КАК НаценкаВБазВалюте
	               |ИЗ
	               |	РегистрНакопления.Продажи КАК Продажи
	               |ГДЕ
	               |	Продажи.Регистратор = &Регистратор
	               |	И Продажи.Партия = &Партия
	               |	И Продажи.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Регистратор",	ТекСтрока.РасходняНакладная);
	Запрос.УстановитьПараметр("Номенклатура",	ТекСтрока.Номенклатура);
	Запрос.УстановитьПараметр("Партия",	 		ТекСтрока.Партия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;

КонецФункции // ПолучитьВыборкуПоПродажам()

Функция ПолучитьВыборкуПоВзаиморасчетам(ТекСтрока)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Долги.Период,
	               |	Долги.Регистратор,
	               |	Долги.Фирма,
	               |	Долги.Док,
	               |	Долги.Валюта,
	               |	Долги.Контрагент,
	               |	Долги.ДолгПокупателя,
	               |	Долги.ПредоплатаПокупателя,
	               |	Долги.ДолгПоставщику,
	               |	Долги.ПредоплатаПоставщику,
	               |	Долги.Покупатель,
	               |	Долги.Поставщик,
	               |	Долги.Чем
	               |ИЗ
	               |	РегистрНакопления.Долги КАК Долги
	               |ГДЕ
	               |	Долги.Регистратор = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор",	 ТекСтрока.РасходняНакладная);
	Запрос.УстановитьПараметр("Номенклатура",	 ТекСтрока.Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции // ПолучитьВыборкуПоВзаиморасчетам()

Функция ВКД_ПолучитьНаценкуПоНаменклатуре(Ссылка,Серия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходнаяНакладнаяТовары.ЦенаЗакупки,
	               |	РасходнаяНакладнаяТовары.ВКД_ЦенаСоСкидкой,
	               |	РасходнаяНакладнаяТовары.ВКД_ЦенаСЗатратами,
	               |	ВЫБОР
	               |		КОГДА РасходнаяНакладнаяТовары.ВКД_ЦенаСЗатратами = 0
	               |			ТОГДА РасходнаяНакладнаяТовары.СуммаПродажи - РасходнаяНакладнаяТовары.ЦенаЗакупки
	               |		КОГДА РасходнаяНакладнаяТовары.ВКД_ЦенаСоСкидкой = 0
	               |			ТОГДА РасходнаяНакладнаяТовары.СуммаПродажи - РасходнаяНакладнаяТовары.ЦенаЗакупки
	               |		ИНАЧЕ РасходнаяНакладнаяТовары.СуммаПродажи - РасходнаяНакладнаяТовары.ВКД_ЦенаСЗатратами
	               |	КОНЕЦ КАК Наценка,
	               |	РасходнаяНакладнаяТовары.СуммаПродажи
	               |ИЗ
	               |	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	               |ГДЕ
	               |	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
	               |	И РасходнаяНакладнаяТовары.Серия = &Серия";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Серия",Серия);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Если Выборка.ВКД_ЦенаСЗатратами = 0 и Выборка.ВКД_ЦенаСоСкидкой = 0 Тогда  //стандартная процедура
		Наценка = Выборка.СуммаПродажи - Выборка.ЦенаЗакупки
	ИначеЕсли Выборка.ВКД_ЦенаСоСкидкой <> 0 И Выборка.ВКД_ЦенаСЗатратами = 0 Тогда  //есть только скидка
		Наценка = Выборка.СуммаПродажи - Выборка.ВКД_ЦенаСоСкидкой 
	Иначе
		Наценка = Выборка.СуммаПродажи - Выборка.ВКД_ЦенаСЗатратами  // есть конечная цена с затратами
	КонецЕсли;
	
	Возврат Выборка.Наценка;
	
КонецФункции
